In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [10]:
path = r"C:\Users\HP\OneDrive\Escritorio\David Guzzi\Github\TSA\Forecasting Principles and Practice 3rd\2\aus_production.csv"

df = pd.read_csv(path)
df.head()

   Quarter  Beer  Tobacco  Bricks  Cement  Electricity  Gas
0  1956 Q1   284   5225.0   189.0     465         3923    5
1  1956 Q2   213   5178.0   204.0     532         4436    6
2  1956 Q3   227   5297.0   208.0     561         4806    7
3  1956 Q4   308   5681.0   197.0     570         4418    6
4  1957 Q1   262   5577.0   187.0     529         4339    5

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 218 entries, 0 to 217
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Quarter      218 non-null    object
 1   Beer         218 non-null    int64
 2   Tobacco      194 non-null    float64
 3   Bricks       198 non-null    float64
 4   Cement       218 non-null    int64
 5   Electricity  218 non-null    int64
 6   Gas          218 non-null    int64
dtypes: float64(2), int64(4), object(1)
memory usage: 12.1+ KB

In [12]:
df[['year', 'Q']] = df['Quarter'].str.split(' ', expand=True)
df['year'] = df['year'].astype(int)
df.head()

   Quarter  Beer  Tobacco  Bricks  Cement  Electricity  Gas  year   Q
0  1956 Q1   284   5225.0   189.0     465         3923    5  1956  Q1
1  1956 Q2   213   5178.0   204.0     532         4436    6  1956  Q2
2  1956 Q3   227   5297.0   208.0     561         4806    7  1956  Q3
3  1956 Q4   308   5681.0   197.0     570         4418    6  1956  Q4
4  1957 Q1   262   5577.0   187.0     529         4339    5  1957  Q1

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 218 entries, 0 to 217
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Quarter      218 non-null    object
 1   Beer         218 non-null    int64
 2   Tobacco      194 non-null    float64
 3   Bricks       198 non-null    float64
 4   Cement       218 non-null    int64
 5   Electricity  218 non-null    int64
 6   Gas          218 non-null    int64
 7   year         218 non-null    int32
 8   Q            218 non-null    object
dtypes: float64(2), int32(1), int64(4), object(2)
memory usage: 14.6+ KB

In [19]:
df[df['year']>=2000]['Beer'].autocorr(lag=6)

-0.7697655849135306

In [22]:
p = df[df['year']>=2000]['Beer'].reset_index(drop=True)
p

0     421
1     402
2     414
3     500
4     451
5     380
6     416
7     492
8     428
9     408
10    406
11    506
12    435
13    380
14    421
15    490
16    435
17    390
18    412
19    454
20    416
21    403
22    408
23    482
24    438
25    386
26    405
27    491
28    427
29    383
30    394
31    473
32    420
33    390
34    410
35    488
36    415
37    398
38    419
39    488
40    414
41    374
Name: Beer, dtype: int64

In [24]:
import statsmodels.api as sm
p = df[df['year']>=2000]['Beer'].reset_index(drop=True)
acf = sm.tsa.acf(p, nlags=9)
pd.DataFrame(acf)

          0
0  1.000000
1 -0.052981
2 -0.758175
3 -0.026234
4  0.802205
5 -0.077471
6 -0.657451
7  0.001195
8  0.707254
9 -0.088756